import Image from 'next/image';
import s from './BrandStory.module.css';

export function BrandStory() {

    return (
        <>
            <div className={s.bannerHeader}>
                <div className={s.bannerHeaderImg}>
                    <p className={s.bannerHeaderText}>Історія Beiens</p>
                </div>
            </div>
            <div className={s.textBox}>
                <h2 className={s.title}>Сім’я</h2>
            </div>
                <p className={s.text}>Створення Beiens почалося з історії Джека, Скарлет і милої родини. Джек і Скарлет — однокласники, подружжя, колеги, а також співзасновники Beiens. Вони знають, довіряють і поважають одне одного вже понад 30 років.</p>
            <div className={s.textBox}>  
                <h2 className={s.title}>Карє’ра</h2>
            </div>
                <p className={s.text}>Після закінчення коледжу Джек почав працювати в індустрії розвиваючих іграшок. Спочатку він був інспектором з якості та звертав увагу на матеріали, з яких зроблені товари, нетоксичність, захист навколишнього середовища тощо. Він полюбляв галузь, у якій працює, і завжди намагався  стежити за тим, щоб продукти та послуги сім’ям і дітям були найвищої якості. Пропрацювавши на цій посаді протягом чотирьох років, він зрозумів, що вплив дизайну товару на дітей так само важливий, як і матеріали. Джек неймовірно зацікавився саме дизайном товарів, тому почав змінювати свою спеціальність на дизайнера іграшок.</p>
            <div className={s.textBox}>
                <h2 className={s.title}>Даніель</h2>
            </div>
                <p className={s.text}>У 2008 році Джек став повноцінним дизайнером розвиваючих іграшок. Дитині Джека і Скарлет, Даніелю, було 4 роки, і він був готовий піти в дитячий садок. Скарлет хотіла найкращого для Даніеля, тому батьки почали багато читати про виховання малюків, а також спілкуватися з численними батьками і експертами з виховання дітей та набувати свого досвіду.</p>
            <div className={s.textBox}>
                <h2 className={s.title}>Монтессорі</h2>
            </div>
                <p className={s.text}>Вони дізналися, що дитинство — це найшвидший етап розвитку мозку в житті людини, здатний створювати понад один мільйон нейронних зв’язків за секунду, швидкість, яку неможливо відтворити на будь-якому наступному етапі. Цей період надзвичайно сильно впливає на подальший розвиток дітей. Молоді батьки відкрили для себе філософію Монтессорі, яка заснована на ідеях вільного виховання і знаходиться в руслі гуманістичної педагогіки. Важливе місце в ній приділено сенсорному вихованню (розвитку органів чуття) за допомогою дидактичних занять та спеціально організованого середовища. Джек і Скарлет все більше усвідомлювали важливість наукового підходу для розвитку дітей, тому вони продовжували вдосконалювати свій професіоналізм у цій галузі.</p>
            <div className={s.textBox}>
                <h2 className={s.title}>Набуте знання</h2>
            </div>
                <p className={s.text}>Джек накопичив понад двадцять років досвіду в дизайні дитячих виробів і вивченні їх матеріалів, а також Джек і Скарлет накопичили величезний освітній досвід у вихованні своєї дитини. Вони захотіли поділитися своїми знаннями з якомога більшою кількістю батьків по всьому світу, тож у 2012 році заснували компанію Beiens, заохочуючи батьків створювати любляче та безпечне середовище, стежити за своїми дітьми та дозволяти їм вчитися поки вони грають.</p>
            <div className={s.textBox}>
                <h2 className={s.title}>Світове визнання</h2>
            </div>
            <p className={s.text}>Beiens продовжує оновлювати лінійку своїх продуктів і удосконалювати послуги. Компанія заснувала свою фабрику і науково-дослідний центр, щоб надавати користувачам більш комплексні та наукові рішення. Сьогодні Beiens розвивається вже понад 10 років і являється брендом, який продається по всьому світу...</p>
                <div className={s.bannerFooter}>
                <div className={s.bannerFooterImg}>
                </div>
            </div>
        </>
    );
}